:PROPERTIES:
:ID:       0e016582-6e91-47e8-b75f-8857f7af26e5
:END:
#+TITLE: Python: Scrapying with Scrapy
#+CATEGORY: slips
#+TAGS:

#+begin_quote
Keep in mind I don't exactly know what I'm doing here.
#+end_quote

Various things can dramatically affect how you approach this.

+ Particularly, whether you're spiders begin on a Domain and are encouraged to
  explore links apropos to that domain (from pages on Domain A to pages on
  Domain B).
+ Whether you're permitted to crawl the data source.
+ Whether you distribute your processes and why.
+ Whether you're using something like Squid.
+ How much javascript affects the content of the code.
+ How clean the datasource is and what your own downstream processes look like.

You should almost always use an API anyways! An API is intended /to produce/
data /suitable to consumers/.

*** Module names

#+begin_quote
For metaprogramming, Ruby > Python ... although /tbf/ Scrapy can't really
benefit from many of the new language features in recent versions of Python3.
#+end_quote

The =scrapy startproject $projectname= command adds =$projectname= to some of
the generated modules/classes. 

#+begin_src sh :dir (identity myprojroot) :results code output :wrap example diff
diff scraping yparcs2
#+end_src

#+RESULTS:
#+begin_example diff
diff '--color=auto' yparcs2/yparcs2/items.py ../scraping/scraping/items.py
9c9
< class Yparcs2Item(scrapy.Item):
---
> class ScrapingItem(scrapy.Item):
diff '--color=auto' yparcs2/yparcs2/middlewares.py ../scraping/scraping/middlewares.py
12c12
< class Yparcs2SpiderMiddleware:
---
> class ScrapingSpiderMiddleware:
59c59
< class Yparcs2DownloaderMiddleware:
---
> class ScrapingDownloaderMiddleware:
diff '--color=auto' yparcs2/yparcs2/pipelines.py ../scraping/scraping/pipelines.py
11c11
< class Yparcs2Pipeline:
---
> class ScrapingPipeline:
diff '--color=auto' yparcs2/yparcs2/settings.py ../scraping/scraping/settings.py
1c1
< # Scrapy settings for yparcs2 project
---
> # Scrapy settings for scraping project
10c10
< BOT_NAME = "yparcs2"
---
> BOT_NAME = "scraping"
12,13c12,13
< SPIDER_MODULES = ["yparcs2.spiders"]
< NEWSPIDER_MODULE = "yparcs2.spiders"
---
> SPIDER_MODULES = ["scraping.spiders"]
> NEWSPIDER_MODULE = "scraping.spiders"
17c17
< #USER_AGENT = "yparcs2 (+http://www.yourdomain.com)"
---
> #USER_AGENT = "scraping (+http://www.yourdomain.com)"
48c48
< #    "yparcs2.middlewares.Yparcs2SpiderMiddleware": 543,
---
> #    "scraping.middlewares.ScrapingSpiderMiddleware": 543,
54c54
< #    "yparcs2.middlewares.Yparcs2DownloaderMiddleware": 543,
---
> #    "scraping.middlewares.ScrapingDownloaderMiddleware": 543,
66c66
< #    "yparcs2.pipelines.Yparcs2Pipeline": 300,
---
> #    "scraping.pipelines.ScrapingPipeline": 300,
Common subdirectories: yparcs2/yparcs2/spiders and ../scraping/scraping/spiders
#+end_example

